{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "userDefinedMetadata": {"signature": {"inputs": {"sequential_3_input:0": {"name": "sequential_3_input:0", "dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_DOUBLE"}, "value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "16"}, {"size": "6"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "sequential_3_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}, "dtype": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["sequential_3_input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_DOUBLE"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/conv2d_5/Relu"], "attr": {"strides": {"list": {"i": ["1", "8", "8", "1"]}}, "ksize": {"list": {"i": ["1", "8", "8", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_DOUBLE"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/conv2d_6/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/max_pooling2d_5/MaxPool", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_DOUBLE"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/max_pooling2d_6/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/conv2d_6/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "T": {"type": "DT_DOUBLE"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/max_pooling2d_6/MaxPool", "StatefulPartitionedCall/sequential_4/sequential_3/flatten/Const"], "attr": {"T": {"type": "DT_DOUBLE"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/flatten/Reshape", "unknown_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_DOUBLE"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/dense_1/MatMul", "unknown_4"], "attr": {"T": {"type": "DT_DOUBLE"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_4/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_4/sequential_3/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_DOUBLE"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/softmax/Softmax"], "attr": {"T": {"type": "DT_DOUBLE"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [4, 4, 3, 8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_0", "shape": [8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_1", "shape": [4, 4, 8, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_2", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_4/sequential_3/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_3", "shape": [16, 6], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_4", "shape": [6], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}